[Killed] StringLiteral
getninjas/dhalsim-js/src/dhalsim.js:2:23
 const defaultDhalsimOptions = {
-  breakingPointValue: '',
+  breakingPointValue: "Stryker was here!",
   tablet: '768px',
   desktop: '960px',
killedBy: MediaQueryContent constructor define default options
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: ""
Received: "Stryker was here!"

[Killed] StringLiteral
getninjas/dhalsim-js/src/dhalsim.js:5:9
   breakingPointValue: '',
   tablet: '768px',
   desktop: '960px',
-  wide: '1200px',
+  wide: "",
 };
 
killedBy: MediaQueryContent constructor define default options
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "1200px"
Received: ""

[Killed] BlockStatement
getninjas/dhalsim-js/src/dhalsim.js:9:24
 };
 
 export default class Dhalsim {
-  constructor(options) {
-    Object.assign(this, defaultDhalsimOptions, options);
-
-    const [body] = document.getElementsByTagName('body');
-
-    this.body = body;
-  }
+  constructor(options) {}
 
   init() {
killedBy: MediaQueryContent constructor define default options
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: ""
Received: undefined

[Killed] BlockStatement
getninjas/dhalsim-js/src/dhalsim.js:17:10
     this.body = body;
   }
 
-  init() {
-    this.renderCSS();
-  }
+  init() {}
 
   renderCSS() {
killedBy: MediaQueryContent init call renderCSS
statusReason: Error: expect(spy).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] StringLiteral
getninjas/dhalsim-js/src/dhalsim.js:47:48
       }
     `;
 
-    const head = document.getElementsByTagName('head')[0];
+    const head = document.getElementsByTagName("")[0];
     const style = document.createElement('style');
 
killedBy: MediaQueryContent renderCSS call renderCSS
statusReason: TypeError: Cannot read property 'appendChild' of undefined

[Killed] BlockStatement
getninjas/dhalsim-js/src/dhalsim.js:55:20
     head.appendChild(style);
   }
 
-  get breakpoint() {
-    this.breakpointValue = window
-      .getComputedStyle(this.body, ':before')
-      .getPropertyValue('content')
-      .replace(/"/g, '');
-
-    return this.breakpointValue;
-  }
+  get breakpoint() {}
 
   isMobile() {
killedBy: MediaQueryContent .breakpoint returns breakpoint value
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "smartphone"
Received: undefined

[Survived] StringLiteral
getninjas/dhalsim-js/src/dhalsim.js:58:25
   get breakpoint() {
     this.breakpointValue = window
       .getComputedStyle(this.body, ':before')
-      .getPropertyValue('content')
+      .getPropertyValue("")
       .replace(/"/g, '');
 

[Killed] BlockStatement
getninjas/dhalsim-js/src/dhalsim.js:64:14
     return this.breakpointValue;
   }
 
-  isMobile() {
-    return this.breakpoint === 'smartphone';
-  }
+  isMobile() {}
 
   isTablet() {
killedBy: MediaQueryContent .isMobile returns true when is smartphone
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: undefined

[Killed] EqualityOperator
getninjas/dhalsim-js/src/dhalsim.js:65:12
   }
 
   isMobile() {
-    return this.breakpoint === 'smartphone';
+    return this.breakpoint !== 'smartphone';
   }
 
killedBy: MediaQueryContent .isMobile returns true when is smartphone
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
getninjas/dhalsim-js/src/dhalsim.js:65:12
   }
 
   isMobile() {
-    return this.breakpoint === 'smartphone';
+    return false;
   }
 
killedBy: MediaQueryContent .isMobile returns true when is smartphone
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BlockStatement
getninjas/dhalsim-js/src/dhalsim.js:68:14
     return this.breakpoint === 'smartphone';
   }
 
-  isTablet() {
-    return this.breakpoint === 'tablet';
-  }
+  isTablet() {}
 
   isDesktop() {
killedBy: MediaQueryContent .isTablet returns true when is tablet
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: undefined

[Killed] ConditionalExpression
getninjas/dhalsim-js/src/dhalsim.js:69:12
   }
 
   isTablet() {
-    return this.breakpoint === 'tablet';
+    return false;
   }
 
killedBy: MediaQueryContent .isTablet returns true when is tablet
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] EqualityOperator
getninjas/dhalsim-js/src/dhalsim.js:69:12
   }
 
   isTablet() {
-    return this.breakpoint === 'tablet';
+    return this.breakpoint !== 'tablet';
   }
 
killedBy: MediaQueryContent .isTablet returns true when is tablet
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BlockStatement
getninjas/dhalsim-js/src/dhalsim.js:72:15
     return this.breakpoint === 'tablet';
   }
 
-  isDesktop() {
-    return this.breakpoint === 'desktop';
-  }
+  isDesktop() {}
 
   isWide() {
killedBy: MediaQueryContent .isDesktop returns true when is desktop
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: undefined

[Killed] EqualityOperator
getninjas/dhalsim-js/src/dhalsim.js:73:12
   }
 
   isDesktop() {
-    return this.breakpoint === 'desktop';
+    return this.breakpoint !== 'desktop';
   }
 
killedBy: MediaQueryContent .isDesktop returns true when is desktop
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
getninjas/dhalsim-js/src/dhalsim.js:73:12
   }
 
   isDesktop() {
-    return this.breakpoint === 'desktop';
+    return false;
   }
 
killedBy: MediaQueryContent .isDesktop returns true when is desktop
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BlockStatement
getninjas/dhalsim-js/src/dhalsim.js:76:12
     return this.breakpoint === 'desktop';
   }
 
-  isWide() {
-    return this.breakpoint === 'wide';
-  }
+  isWide() {}
 
   beyondTablet() {
killedBy: MediaQueryContent .isWide returns true when is wide
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: undefined

[Killed] ConditionalExpression
getninjas/dhalsim-js/src/dhalsim.js:77:12
   }
 
   isWide() {
-    return this.breakpoint === 'wide';
+    return false;
   }
 
killedBy: MediaQueryContent .isWide returns true when is wide
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] EqualityOperator
getninjas/dhalsim-js/src/dhalsim.js:77:12
   }
 
   isWide() {
-    return this.breakpoint === 'wide';
+    return this.breakpoint !== 'wide';
   }
 
killedBy: MediaQueryContent .isWide returns true when is wide
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BlockStatement
getninjas/dhalsim-js/src/dhalsim.js:80:18
     return this.breakpoint === 'wide';
   }
 
-  beyondTablet() {
-    return this.isDesktop() || this.isWide();
-  }
+  beyondTablet() {}
 
   beyondMobile() {
killedBy: MediaQueryContent .beyondTablet returns true when it is larger than tablets
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: undefined

[Killed] ConditionalExpression
getninjas/dhalsim-js/src/dhalsim.js:81:12
   }
 
   beyondTablet() {
-    return this.isDesktop() || this.isWide();
+    return false;
   }
 
killedBy: MediaQueryContent .beyondTablet returns true when it is larger than tablets
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] LogicalOperator
getninjas/dhalsim-js/src/dhalsim.js:81:12
   }
 
   beyondTablet() {
-    return this.isDesktop() || this.isWide();
+    return this.isDesktop() && this.isWide();
   }
 
killedBy: MediaQueryContent .beyondTablet returns true when it is larger than tablets
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BlockStatement
getninjas/dhalsim-js/src/dhalsim.js:84:18
     return this.isDesktop() || this.isWide();
   }
 
-  beyondMobile() {
-    return this.isTablet() || this.beyondTablet();
-  }
+  beyondMobile() {}
 }
 
killedBy: MediaQueryContent .beyondMobile returns true when is larger then smartphone
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: undefined

[Killed] ConditionalExpression
getninjas/dhalsim-js/src/dhalsim.js:85:12
   }
 
   beyondMobile() {
-    return this.isTablet() || this.beyondTablet();
+    return false;
   }
 }
killedBy: MediaQueryContent .beyondMobile returns true when is larger then smartphone
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] LogicalOperator
getninjas/dhalsim-js/src/dhalsim.js:85:12
   }
 
   beyondMobile() {
-    return this.isTablet() || this.beyondTablet();
+    return this.isTablet() && this.beyondTablet();
   }
 }
killedBy: MediaQueryContent .beyondMobile returns true when is larger then smartphone
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false
