[Killed] ConditionalExpression
getninjas/dhalsim-js/src/dhalsim.js:65:12
   }
 
   isMobile() {
-    return this.breakpoint === 'smartphone';
+    return true;
   }
 
killedBy: MediaQueryContent .isWhat??? dont return true when is not smartphone
statusReason: Error: expect(received).not.toBe(expected) // Object.is equality

Expected: not true

[Killed] ConditionalExpression
getninjas/dhalsim-js/src/dhalsim.js:77:12
   }
 
   isWide() {
-    return this.breakpoint === 'wide';
+    return true;
   }
 
killedBy: MediaQueryContent .isWhat??? dont return true when is not smartphone
statusReason: Error: expect(received).not.toBe(expected) // Object.is equality

Expected: not true
